lg/advanced/backend/controllers/AdminRoleController.php

SELECT COUNT(*) FROM `admin_role`
SELECT * FROM `admin_role` LIMIT 10
---
    public function actionIndex()
    {
        $query = AdminRole::find();
         $querys = Yii::$app->request->get('query');
        if(count($querys) > 0){
            $condition = "";
            $parame = array();
            foreach($querys as $key=>$value){
                $value = trim($value);
                if(empty($value) == false){
                    $parame[":{$key}"]=$value;
                    if(empty($condition) == true){
                        $condition = " {$key}=:{$key} ";
                    }
                    else{
                        $condition = $condition . " AND {$key}=:{$key} ";
                    }
                }
            }
            if(count($parame) > 0){
                $query = $query->where($condition, $parame);
            }
        }
        //$models = $query->orderBy('display_order')
        $pagination = new Pagination([
            'totalCount' =>$query->count(),
            'pageSize' => '10',
            'pageParam'=>'page',
            'pageSizeParam'=>'per-page']
        );
        $models = $query
        ->offset($pagination->offset)
        ->limit($pagination->limit)
        ->all();

SELECT * FROM `admin_role` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = AdminRole::findOne($id)) !== null) {