lg/advanced/backend/controllers/BaseController.php

    private function verifyPermission($action){
        $route = $this->route;
        // 检查是否已经登录
        if(Yii::$app->user->isGuest){
            $allowUrl = ['site/getcode','site/index','site/captcha','site/login'];
            if(in_array($route, $allowUrl) == false){
                $this->redirect(Url::toRoute('site/index'));
                return false;
            }
        }
        else{
            $system_rights = Yii::$app->user->identity->getSystemRights();
            $loginAllowUrl = ['site/getcode','site/index', 'site/logout', 'site/psw', 'site/psw-save'];
            if(in_array($route, $loginAllowUrl) == false){
               if((empty($system_rights) == true || empty($system_rights[$route]) == true)){
                    header("Content-type: text/html; charset=utf-8");
                    //exit('没有权限访问'.$route);
               }
               $rights = $system_rights[$route];
               if($route != 'system-log/index'){
                    $systemLog = new AdminLog();
                    $systemLog->url = $route;
                    $systemLog->controller_id = $action->controller->id;
                    $systemLog->action_id = $action->id;
                    $systemLog->module_name = $rights['module_name'];
                    $systemLog->func_name = $rights['menu_name'];
                    $systemLog->right_name = $rights['right_name'];
                    $systemLog->create_date = date('Y-m-d H:i:s');
                    $systemLog->create_user = Yii::$app->user->identity->uname;
                    $systemLog->client_ip = CommonFun::getClientIp();
                    $systemLog->save();
---
INSERT INTO `admin_log` (`url`, `controller_id`, `action_id`, `module_name`, `func_name`, `right_name`, `create_date`, `create_user`, `client_ip`) VALUES ('admin-module/index', 'admin-module', 'index', '菜单用户权限', '菜单管理', '一级菜单查看', '2018-04-02 07:10:55', 'admin', 'Unknown')