lg/advanced/backend/controllers/FirmController.php

    protected function findModel($id)
    {
        if (($model = Firm::findOne($id)) !== null) {
---
SELECT * FROM `firm` WHERE `firm_id`='1'