lg/advanced/backend/controllers/SiteController.php

        $db = Yii::$app->db;
        $id = $info['id'];
        $count = 0;
         $res = $db -> createCommand()->update('admin_user',[
            'count' => "$count"
            ],"id=$id")->execute();
        if(AdminUser::login($username, $password, $rememberMe) == true){
                 AdminUser::updateAll(
                ['last_ip' => CommonFun::getClientIp()],
                ['uname' => $username]);
---
UPDATE `admin_user` SET `count`=0 WHERE id=156
UPDATE `admin_user` SET `last_ip`='Unknown' WHERE `uname`='admin'

                //     echo "用户已冻结";
                //     exit();
                // }
              $res = $db -> createCommand()->update('admin_user',['update_date'=>"$update_date",
            'count' => "$count"
            ],"id=$id")->execute();
---
UPDATE `admin_user` SET `update_date`='2018-03-16 10-18-21', `count`=2 WHERE id=156


        //print_r(AdminUser::login($username, $password, $rememberMe) == true);die;
        if(AdminUser::login($username, $password, $rememberMe) == true){
             AdminUser::updateAll(
                ['last_ip' => CommonFun::getClientIp()],
                ['uname' => $username]);
---
UPDATE `admin_user` SET `last_ip`='Unknown' WHERE `uname`='admin'