lg/advanced/backend/models/BackendUser.php

SELECT * FROM `admin_user` WHERE (`uname`='admin') AND (`status`=10)
---
    public static function findByUsername($username)
    {
        // echo AdminUser::findOne([
        //     'uname' => $username,
        //     'status' => self::STATUS_ACTIVE
        // ]);die;
        return AdminUser::findOne([
            'uname' => $username,
            'status' => self::STATUS_ACTIVE
        ]);